{
  "apa yang dimaksud dengan topik utama ini?": "C (Personal Computer) adalah komputer yang dirancang untuk digunakan oleh satu orang pada satu waktu. PC terdiri dari berbagai komponen yang bekerja bersama untuk menjalankan berbagai tugas, seperti mengolah data, browsing internet, bermain game, dan banyak lagi. Istilah \"PC\" pertama kali digunakan oleh IBM pada tahun 1981 untuk merujuk pada komputer pribadi.",
  "apa saja komponen utama pc?": "CPU (Central Processing Unit): Otak dari PC, bertanggung jawab untuk mengeksekusi instruksi.",
  "apa yang kamu ketahui tentang ram (random access memory)?": "Tempat penyimpanan sementara untuk data yang sedang digunakan.",
  "apa yang kamu ketahui tentang storage (penyimpanan)?": "Menyimpan data dan program secara permanen (HDD atau SSD).",
  "apa yang kamu ketahui tentang motherboard?": "Papan sirkuit utama yang menghubungkan semua komponen PC.",
  "apa yang kamu ketahui tentang gpu (graphics processing unit)?": "Mengelola tampilan grafis pada layar.",
  "apa saja jenis-jenis pc?": "Desktop PC: Komputer yang ditempatkan di atas meja, biasanya memiliki kinerja lebih tinggi dan kemampuan upgrade yang lebih mudah.",
  "apa yang kamu ketahui tentang laptop?": "Komputer portabel yang mudah dibawa ke mana-mana.",
  "apa yang kamu ketahui tentang all-in-one pc?": "Menggabungkan CPU, monitor, dan speaker dalam satu unit.",
  "apa fungsi dari pc?": "PC digunakan untuk berbagai keperluan, mulai dari tugas sekolah atau pekerjaan kantor, hingga hiburan seperti bermain game, menonton video, dan mendengarkan musik.",
  "apa saja tips memilih pc?": "Kebutuhan Penggunaan: Apakah untuk pekerjaan, hiburan, atau kreativitas?",
  "apa yang kamu ketahui tentang anggaran?": "Tetapkan anggaran yang sesuai dengan kebutuhan.",
  "apa yang kamu ketahui tentang spesifikasi teknis?": "Perhatikan kecepatan CPU, kapasitas RAM, dan jenis penyimpanan.",
  "apa yang kamu ketahui tentang kemampuan upgrade?": "Pastikan PC dapat ditingkatkan jika diperlukan di masa depan."
}